Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t struct represents the handle of a bitmap drawn in the view.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Id
The identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.ViewId
The view identifier.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.Location
The location.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.BitmapIdentifier
The identifier of the bitmap, expected to point to an instance of Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmap_t.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotBitmapHandle_t.ToString
Returns a System.String representation of the current instance.
Returns:
A System.String representation of the current instance.